<template>
  <div>
    <h2>发布部署</h2>
    <p>正式环境发布前一定要通过测试环境，哪怕一些小的改动。</p>
    <h4>版本控制</h4>
    <p>每个项目发布时候都要定义个版本号，并且最好发布版本都打tag，其作用有：</p>
    <p>1. 利于项目的维护。</p>
    <p>2. 出现问题及时发现发布的版本，无论是修复还是还愿前版本都很方便。</p>
    <p>3. 版本号在页面可以隐藏也可以显示，后台管理系统最好是显示出来。</p>
    <h4>打包配置</h4>
    <dl>
      <dt>压缩打包</dt>
      <dd>开发环境和生产环境都独立出来，开发环境用于开发调试，生产环境用于打包压缩。</dd>
      <dd>生产环境文件最好进行打包压缩出来，需要压缩的有css, js, images等文件。</dd>
      <dt>自动化构建</dt>
      <dd>推荐使用Jenkins进行线上打包自动化构建配置。</dd>
      <dd>官方地址：<a href="https://jenkins.io/index.html" target="_block">jenkins.io</a></dd>
      <dd>功能包括：</dd>
      <dd>1. 持续的软件版本发布/测试项目。</dd>
      <dd>2. 监控外部调用执行的工作。</dd>
    </dl>
    <h4>部署文档</h4>
    <p>每个项目上线部署前最好有对应的部署文档，这样的好处有：</p>
    <p>1. 运维人员可进行线上打包等操作，直接进行部署。</p>
    <p>2. 开发人员只要维护开发环境</p>
  </div>
</template>
