<template>
  <div>
    <h2>需求评审及技术选型</h2>
    <h4>需要考虑的问题</h4>
    <ul>
      <li><strong>1. 业务需求：</strong>平台（PC、移动端）选择，兼容、易用性考虑。</li>
      <li><strong>2. 性能优化：</strong>CDN部署、缓存控制、文件指纹、缓存复用、请求合并、按需加载、同步/异步加载、HTTP 服务端资源推送、SEO的优化。</li>
      <li><strong>3. 开发成本：</strong>现有平台所用技术（重构），团队合作开发中人员的技能（熟练程度）、开发习惯（学习、前后端对接磨合）成本等。</li>
      <li><strong>4. 开发时间：</strong>开发周期、上线时间、人员是否充足。</li>
      <li><strong>5. 后期维护：</strong>维护复杂度，版本控制。</li>
      <li><strong>6. 其他因素：</strong>如猪八戒总平台使用的框架技术，需要做嵌入、合并兼容考虑。</li>
    </ul>
    <h4>前端技术框架选型参考</h4>
    <ul>
      <li>随着Web技术的不断发展，前端架构框架、UI框架、构建工具、CSS预处理等层出不穷，各有千秋，常见得选型方向有：</li>
      <li><strong>1. 库/框架：</strong>有jQuery、Vue、React、Angularjs、pug、Bootstrap等。</li>
      <li><strong>2. 自动化构建工具：</strong>gulp、webpack、grunt等。</li>
      <li><strong>3. JS/CSS模块化开发：</strong>JS模块化方案有AMD/CommonJS/UMD/ES6 Module等；CSS模块化开基发本都是在less、sass、stylus等预处理器。</li>
    </ul>
    <h4>技术方案</h4>
    <h5>方案一：jQuery + JSP + gulp 传统Web开发模式</h5>
    <p><strong>优点：</strong></p>
    <p>SEO优化友好。</p>
    <p><strong>缺点：</strong></p>
    <p>JSP是后端渲染，增加服务器压力，传输数据量大。</p>
    <p>需要在本地搭建、部署Java运行环境，对前端人员来说开发更复杂。</p>
    <p>开发中前后端联系较紧密，相互影响，前后端沟通成本大。</p>
    <h5>方案二：Node + Vue + webPack 前后端分离开发模式</h5>
    <p><strong>优点：</strong></p>
    <p>JS可以做很大部分的数据处理工作，无需渲染页面，java只负责使用rest收发json数据，对服务器的压力减小到最小，性能肯定更高了。</p>
    <p>后台错误不会直接反映到前台，错误接秒较为友好。</p>
    <p>手机App与PC端网站可以共用同一套接口。</p>
    <p><strong>缺点：</strong>单页应用相对于传统的网页来说SEO并不是那么友好，书签功能需要自己写代码支持。</p>
    <h5>方案三：jQuery + PUG + gulp 前后端分离模式</h5>
    <p><strong>优点：</strong></p>
    <p>编译后纯静态页面，纯静态渲染页面快。</p>
    <p>开发前后端分离有利维护。</p>
    <p><strong>缺点：</strong></p>
    <p>不利于SEO</p>
    <h4>方案适配</h4>
    <p>综合公司目前的业务需求来说主要分为一下几种开发类型网站（网页）：</p>
    <dl>
      <dt>1.  门户内容展示类（PC）</dt>
      <dd>特点 ： 需求持续迭代、TO C 类应用、长期项目、大中型项目，对外对外运营业务。</dd>
      <dd>要求 ： 稳定，快速，无障碍，高可靠性，兼容性强，强SEO、可维护性，业务隔离等。</dd>
      <dd>技术选型 ：方案一和方案二都行，具体团队讨论决定。</dd>
    </dl>
    <dl>
      <dt>2.  门户展示类（移动端）</dt>
      <dd>特点 ： 需求持续迭代、TO C 类应用、长期项目、大中型项目，对外对外运营业务。</dd>
      <dd>要求 ： 项目代码可维护性，业务隔离，代码足够小，适应移动端复杂的网络环境等。</dd>
      <dd>技术选型 ：推荐方案二。</dd>
    </dl>
    <dl>
      <dt>3.  后台管理系统</dt>
      <dd>特点 ：页面UI、交互相近，多表单操作、查询条件因素丰富、列表数据展示、图形报表展示、增删改查等业务操作多。</dd>
      <dd>要求 ：统一的UI、交互规则，代码复用率高，交互复杂等。</dd>
      <dd>技术选型 ：推荐方案二。</dd>
    </dl>
    <dl>
      <dt>4.  活动、营销、专题类型</dt>
      <dd>特点 ：时效性强，线上运营时间短，多图片展示，业务轻，交互简单。</dd>
      <dd>要求 ：急速打开页面，快速开发上线。</dd>
      <dd>技术选型 ：推荐方案二、方案三。</dd>
    </dl>
  </div>
</template>
